[
  {
    "id": "b1",
    "name": "Slimline Notebook Combination Lock",
    "description": "Protect your notebook with the Gizzu Slimline Combination Lock. Its reinforced cable and 4-digit code secure your device, and the slim design fits thinner notebooks like ultrabooks. The cable connection pivots and rotates for effortless installation, while its pull-resistant design enhances protection against forced entry. Simple to set up, this lock offers a reliable way to physically secure your device and prevent theft.",
    "category": "Accessories",
    "condition": "Brand New",
    "image": "/lock cable.jpg",
    "images": ["/lock cable.jpg", "/lock cable1.jpg"],
    "brand": "Gizzu",
    "inStock": true,
    "features": [
      "Easy to Install",
      "Combination Lock",
      "200cm Cable Length",
      "Reinforced Cable",
      "Strong & Durable",
      "Commpatible with Laptops & Ultrabooks"
    ]
  },
  {
    "id": "b2",
    "name": "Gizzu Standard Security Key Lock",
    "description": "Protect your device against theft with the Gizzu T-Bar Standard Security Lock. Wrap the reinforced cable around a secure object, insert the lock into your notebook’s lock slot, and secure with your key.",
    "category": "Accessories",
    "condition": "Brand New",
    "image": "/security.jpg",
    "images": ["/security1.jpg", "/security2.jpg"],
    "brand": "Gizzu",
    "inStock": true,
    "features": ["Cable Length: 1.8m","T-Bar Lock","Noble Wedge lock slot (for Dell 3.2mm x 4.5mm slot)", "2x user keys", "Easy to Install", "Reinforced cable"]
  },
  {
    "id": "ps1",
    "name": "Everglow Rechargeable Emergency Bulb",
    "description": "Keep your space lit during loadshedding with the Gizzu Everglow Rechargeable Downlight Bulb. This 3W GU10 bulb features a built-in 300mAh battery that recharges in about 5 hours and provides up to 5 hours of emergency light. It automatically switches to cool white mode during power cuts and offers adjustable brightness levels of 25%, 50%, and 100% through a simple on/off toggle. Smart Bulb Technology ensures it detects power failures and activates only when needed.",
    "category": "Lighting",
    "condition": "Brand New",
    "image": "/bulb.jpg",
    "images": ["/bulb.jpg", "/bulb4.jpg", "/bulb1.png", "/bulb5.jpg","/bulb2.png", "/bulb3.jpg"],
    "brand": "Gizzu",
    "inStock": true,
    "features": ["Up to 25000-hours", "Smart Bulb Technology", "Automatically switches to emergency mode in the event of loadshedding or a power failure", "Select between 3 brightness levels to prolong battery life (the default brightness level is 100%)", "Keep your lights powered for up to 5 additional hours"]
  },
  {
    "id": "pb1",
    "name": "1000A Jump Starter 10400mAh",
    "description": "Give your car a boost with the Gizzu 1000A Smart Jump Starter. It features a 10400mAh high capacity lithium-ion battery, a compact design, comes with a sparkless smart cable, built-in LED flashlight, Smart Protection, a durable carry case and supports up to 5l petrol and 3l diesel vehicles.",
    "category": "On The Go",
    "condition": "Brand New",
    "image": "/Jump.jpg",
    "images": ["/jump2.jpg", "/jump3.jpg", "/jump4.jpg"],
    "brand": "Gizzu",
    "inStock": true,
    "features": ["Lithium-Ion Battery Technology", "10400mAh High Capacity", "Support for up to 5l Petrol and 3l Diesel Vehicles", "Sparkless Smart Cable", "Compact Design with Durable Carry Case", "Built-in LED Flashlight", "Smart Protection", "Output: 5V/3A, 9V/2A, 12V/1.5A", "Weight: 361g"]
  },
  {
    "id": "l1",
    "name": "Hero Maz 1024WH/1000W Power Station",
    "description": "The Gizzu Hero Max UPS Power Station provides 1024Wh of reliable portable power for appliances and devices during load-shedding or outdoor use. It features multiple output ports, pure sine wave technology for smooth power switching, and a fast-charging LiFePO4 battery that recharges in 1.3 hours. With safety protections and support for appliances up to 1200W, it's a durable and versatile solution for home or adventure.",
    "category": "Power Stations",
    "condition": "Brand New",
    "image": "/hero.jpg",
    "images": ["/hero1.jpg", "/hero2.jpg", "/hero3.jpg"],
    "brand": "Gizzu",
    "inStock": true,
    "features": ["1024Wh lithium iron phosphate (LiFePO4) batteries with 3x more battery cycles than a typical lithium ion battery.", "Features UPS functionality with 10ms switchover", "Recharge the battery from 0% to 100% within 1.3 hours", "Multiple input charging options (car, solar panel or from wall sockets).", "AC Input: 220-240V/50Hz 1000W Max (1.3hrs)", "Battery Capacity: 1024Wh", "Lifespan: 3500 cycles to 80%", "Short-Circuit & Over-Current Protection", "Over-Voltage & Under-Voltage Protection", "Over-Load & Temperature Protection"]
  },
  {
    "id": "a1",
    "name": "Hero Pro 2048Wh UPS Power Station",
    "description": "The Gizzu Hero Pro UPS Power Station delivers 2048Wh of portable power for both outdoor adventures and home use during load-shedding. It supports multiple devices with dual AC outlets, USB and Type-C ports, DC outputs, a car socket, and an XT60 port. Featuring pure sine wave technology and UPS functionality, it ensures uninterrupted power during outages. Its fast-charging LiFePO4 battery recharges fully in just 2 hours and lasts up to 3500 cycles. With safety protections and support for appliances up to 2400W, the Hero Pro is a reliable, durable, and versatile power solution.",
    "category": "Power Stations",
    "condition": "Brand New",
    "image": "/gizzu pro1.jpg",
    "images": ["/gizzu pro.jpg", "/gizzu pro1.jpg", "/gizzu pro2.jpg", "/gizzu pro3.jpg"],
    "brand": "Gizzu",
    "inStock": true,
    "features": ["2048Wh Lithium Iron Phosphate (LiFePO4) batteries", "Features UPS functionality with 10ms switchover", "Charge from 0-100 in 2 hours", "AC Input: 220-240V/50Hz 1100W Max (2hrs)", "MPPT (Anderson) Input: 11.5-50V/25A 500W Max (4.8hrs)", "Short-Circuit & Over-Current Protection", "Over-Voltage & Under-Voltage Protection", "Over-Load & Temperature Protection"]
  },
  {
    "id": "u1",
    "name": "Mi Smart LED Desk Lamp Pro",
    "description": "This smart desk lamp offers wide, even lighting with flexible three-axis adjustment, a 116 mm LED panel, and eye-friendly, flicker-free illumination. It features stepless brightness and colour temperature control plus dual voice-control support, giving you customizable, comfortable light for any workspace.",
    "category": "Lighting",
    "condition": "Brand New",
    "image": "/table4.jpg",
    "images": ["/table1.jpg", "/table2.jpg", "/table3.jpg"],
    "brand": "Xiaomi",
    "inStock": true,
    "features": ["Reading and writing desk lamp", "Color Temperature 2500–4800K", "25,000 hours Service Life Approx.", "Rated Input: 100–240 V, 50/60 Hz, 0.5 A", "Wi-Fi IEEE 802.11b/g/n 2.4 GHz   Bluetooth 4.2 BLE", "Android 4.4 or iOS 9.0 and above"]
  },
  {
    "id": "c1",
    "name": "Mi 4K Laser Projector 150 Inch",
    "description": "Enjoy a true home-theater experience with this ultra short-throw laser projector, capable of projecting an 80–150 inch screen from just 5–50 cm away. Powered by ALPD 3.0 technology and a 3000:1 native contrast ratio, it delivers bright, sharp, and colour-rich visuals with 1080p resolution and HDR support. Its anti-direct vision sensor enhances eye safety, while the compact design fits easily on a TV cabinet or wall mount.",
    "category": "Projectors",
    "condition": "Brand New",
    "image": "/projector.jpg",
    "images": ["/projector.jpg", "/projector1.jpg", "/projector2.jpg"],
    "brand": "Xiaomi",
    "inStock": true,
    "features": ["Projects a large 80–150 inch screen from an ultra short distance of just 5–50 cm.", "Uses ALPD 3.0 laser technology for bright, sharp, and vivid image quality.", "Offers a high 3000:1 native contrast ratio for clear detail in dark scenes.", "Features DLP projection and efficient 15W performance", "Supports Full HD 1080p resolution and HDR content for enhanced viewing.", "Includes an anti-direct vision sensor to protect eyes from direct laser exposure."]
  },  
  {
    "id": "u2",
    "name": "Xiaomi Smart Camera C500 Pro",
    "description": "The Xiaomi Smart Camera C500 Pro offers ultra-clear 3K video, 360° coverage, and smart AI detection for humans, pets, and baby cries. It features two-way audio, voice assistant support, and a retractable lens shield with advanced encryption, ensuring full security and privacy.",
    "category": "Cameras",
    "condition": "Brand New",
    "image": "/camera.jpg",
    "images": ["/camera.jpg", "/camera1.jpg", "/camera2.jpg"],
    "brand": "Xiaomi",
    "inStock": true,
    "features": ["Captures ultra-clear 3K video (5 MP sensor) with HDR and low-light color or infrared modes. ", "Provides 360° horizontal and 114° vertical coverage via dual-motor pan–tilt–zoom — no blind spots. ", "Smart AI detection notifies you about humans, pets, baby cries or loud noises, with customizable monitoring zones. ", "Offers two-way voice communication, plus support for voice control through Alexa or Google Assistant.", "Includes a physical retractable lens shield and MJA1 security chip with AES-128 encryption for strong privacy protection.", "Supports flexible storage options: microSD (up to 256 GB), NAS or encrypted cloud, with efficient H.265 video encoding."]
  },
  {
    "id": "u3",
    "name": "Mi Smart Kettle Pro",
    "description": "The Mi Smart Kettle Pro is a high‑capacity smart electric kettle that brings precision temperature control and modern convenience to your kitchen. With a clear HD digital display, adjustable temperature settings (40 – 90 °C), and a 1.5 L stainless‑steel interior, it lets you boil water quickly or keep water warm for hours — ideal for tea, coffee, baby formula, and more. Its double‑wall design keeps the exterior cool, while built‑in safety protections and automatic shut‑off give you peace of mind. Sleek, practical, and easy to use, this kettle blends performance, safety, and style. ",
    "category": "Accessories",
    "condition": "Brand New",
    "image": "/kettle.jpg",
    "images": ["/kettle.jpg", "/kettle1.jpg"],
    "brand": "Xiaomi",
    "inStock": true,
    "features": ["Real‑time temperature display on an HD digital screen.", "Adjustable temperature modes from 40 °C to 90 °C for different uses (e.g. warm water, tea, coffee, baby formula).", "1.5 L capacity — enough to serve multiple cups without frequent refilling.", "1800 W high‑power heating for fast boiling.", "Interior made of food‑grade 304 stainless steel, resistant to rust and odors, and easy to clean.", "Double‑wall insulated body — stays cool outside while keeping water hot inside.", "Triple safety protection: automatic shut-off after boiling, dry‑burn prevention, and electric shock protection.", "Large, easy-clean spout and a well-designed lid for safe pouring and maintenance.", "Neat design with a power cord storage base for a tidy kitchen look."]
  },
  {
    "id": "u4",
    "name": "Xiaomi LCD Writing Tablet 13.5 Inch",
    "description": "The Xiaomi 13.5 Color LCD Writing Tablet lets you write, draw, and erase instantly with vivid, pressure-sensitive strokes. Lightweight, portable, and eye-friendly, it’s perfect for notes, sketches, and creative ideas anywhere.",
    "category": "Accessories",
    "condition": "Brand New",
    "image": "/tab1.jpg",
    "images": ["/tab1.jpg", "/tab2.jpg", "/tab3.jpg"],
    "brand": "Xiaomi",
    "inStock": true,
    "features": ["13.5 inch color LCD panel with vivid, paper-like strokes.", "Pressure-sensitive writing for expressive lines.", "One-tap erase for instant clearing.", "Magnetic stylus with built-in storage.", "Slim, lightweight, and portable design.", "Eye-friendly display with no blue-light emission.", "Long-lasting battery, up to a year."]
  },
  {
    "id": "u5",
    "name": "Xiaomi Mi Power Bank 3 Ultra Compact",
    "description": "The Xiaomi 10000mAh Mi Power Bank 3 Ultra Compact is a lightweight, pocket-sized power bank capable of charging your smartphone up to three times. With triple-device charging, Type-C two-way fast charging, and multiple input/output ports, it’s ideal for smartphones, tablets, and devices like the Nintendo Switch. Advanced circuitry ensures stable voltage, high conversion efficiency, and multi-protection, making it a reliable everyday power companion.",
    "category": "Power Banks",
    "condition": "Brand New",
    "image": "/bank.jpg",
    "images": ["/bank.jpg","/bank1.jpg", "/bank2.jpg", "/bank3.jpg"],
    "brand": "Xiaomi",
    "inStock": true,
    "features": ["Ultra-compact and portable design (≈200 g).", "10000 mAh high capacity for multiple full charges.", "OTriple-device charging with Type-C + 2 USB-A ports.", "Type-C two-way fast charging, up to 22.5 W.", "Multiple input options: Type-C and Micro-USB.", "Advanced circuitry with voltage stabilization and multi-protection.", "Compatible with smartphones, tablets, and the Switch."]
  },
  {
    "id": "u6",
    "name": "Xiaomi Mi Power Bank 3 Ultra Compact",
    "description": "The Xiaomi Mi USB‑C Cable (White) is a simple yet reliable charging and data cable, compact, reversible, and built for everyday use. It connects Type‑C devices (phones, tablets, laptops, power banks) with ease and supports both charging and data transfer in a sturdy, flexible design.",
    "category": "Power Banks",
    "condition": "Brand New",
    "image": "/cable.jpg",
    "images": ["/cable.jpg","/cable1.jpg"],
    "brand": "Xiaomi",
    "inStock": true,
    "features": ["Reversible USB‑C connector. Plug in either way without worrying about orientation.", "Supports fast charging (up to 3A) and standard data transfer, delivering reliable power and syncing.", "Durable build with a flexible TPE outer jacket and reinforced connector joints to resist bending and wear.", "USB 2.0-compatible. Provides stable charging and data transfer for most modern devices using USB‑C."]
  },
  {
    "id": "c6",
    "name": "Mi Wireless Outdoor Security Camera 1080",
    "description": "The Xiaomi Mi Wireless Outdoor Security Camera 1080p Set is a fully‑wireless, weather‑resistant surveillance solution ideal for securing homes, gardens, driveways, or small businesses. With a Full HD 1080p camera, wide-angle view, battery power, and an included indoor receiver. It delivers clear video day or night, smart motion detection, and flexible storage options. Installation is simple and cable‑free, while robust build and IP65 rating make it suitable for outdoor use in varied weather.",
    "category": "Cameras",
    "condition": "Brand New",
    "image": "/mi4.jpg",
    "images": ["/mi1.jpg","/mi2.jpg", "/mi3.jpg", "/mi4.jpg"],
    "brand": "Xiaomi",
    "inStock": true,
    "features": ["Full HD (1920×1080) resolution with a 130° wide‑angle lens and F2.1 aperture for broad coverage and sharp detail.", "Wire‑free design with a 5700 mAh built‑in battery. Lasts up to ~90 days on a single charge (depending on usage).", "PIR human motion detection (up to ~7 m range), sending instant alerts to your phone when movement is sensed.", "Night vision + wide dynamic range (WDR) ensures clear video even in low light or contrasting light conditions.", "IP65 dust‑ and water‑resistant housing, built to withstand outdoor conditions from –20°C to 50°C.", "Flexible storage options: Save video locally via MicroSD (up to 32 GB) or USB drive, or use cloud storage via the indoor receiver." , "One indoor receiver can support up to four outdoor cameras. Useful for monitoring multiple areas with a single hub.", "Two‑way audio (built-in microphone and speaker). Lets you talk directly through the camera (e.g. to delivery people or guests) when paired with the companion app."]
  },
  {
    "id": "c7",
    "name": "Xiaomi 1080P Wireless Camera and Receiver",
    "description": "The Xiaomi Mi Wireless Outdoor Security Camera 1080p is a wireless, weatherproof camera with Full HD video, 130° wide-angle view, night vision, two-way audio, and motion alerts, providing easy, reliable outdoor security with flexible storage options.",
    "category": "Cameras",
    "condition": "Brand New",
    "image": "/cam.jpg",
    "images": ["/cam.jpg","/cam1.jpg", "/cam2.jpg"],
    "brand": "Xiaomi",
    "inStock": true,
    "features": ["Full HD 1080p resolution for clear detail day and night.", "130° wide-angle lens for broad coverage of driveways, gardens, or entrances.", "Wireless, battery-powered design (built-in ~5700 mAh battery) for up to 90 days per charge. No wiring needed.", "PIR human detection with ~7 m range, sending instant alerts on motion or suspicious activity.", "Night vision + WDR technology + f/2.1 aperture. Ensures clear video even in low light or backlit conditions.", "Weatherproof with IP65 rating. Works reliably outdoors in temperatures from about –20 °C to 50 °C.", "Two-way audio (microphone + speaker). Lets you communicate through the camera via your smartphone.", "Supports multiple storage options. Local (MicroSD card / USB) or optional cloud storage, depending on your preference."]
  },
  {
    "id": "c8",
    "name": "Xiaomi Mi Smart Sport Wireless Watch",
    "description": "Stay on top of your fitness with the Xiaomi Sporty Smart Wireless Watch, the ultimate companion for an active lifestyle. Featuring a sleek, sporty design, this watch offers a range of smart features including 24-hour heart rate monitoring, 117 sports modes, and water resistance up to 5 ATM. Track your workouts, monitor your daily activity, and make the most of every exercise with this versatile and stylish wearable.",
    "category": "Accessories",
    "condition": "Brand New",
    "image": "/watch.jpg",
    "images": ["/watch.jpg","/watch1.jpg"],
    "brand": "Xiaomi",
    "inStock": true,
    "features": ["24-Hour Continuous Heart Rate Monitoring – Track your heart performance during exercise and rest.", "117 Custom Sports Modes – Supports a wide range of sports and activities.", "Water Resistant up to 5 ATM – Swim or shower without worry.", "Sleep Quality Monitoring – Provides detailed analysis of sleep stages.", "Long-Lasting Battery – Up to 14 days of regular use.", "Built-in GPS – Records outdoor activities accurately.", "Magnetic Fast Charging – Quick and convenient charging."]
  },
  {
    "id": "c9",
    "name": "Xiaomi Handheld Vacuum Cleaner G9/G10 HEPA Filter",
    "description": "Revitalize your Mi Vacuum Cleaner G10 or G9 with the Xiaomi Mi Vacuum Cleaner G10/G9 HEPA Filter Pack. This pack includes 2 pre-HEPA filters and 1 HEPA filter for superior cleaning performance. It’s easy to install, simple to clean, budget-friendly, and delivers H12 filtration efficiency, while the pre-HEPA filters help maintain stronger suction and longer-lasting performance.",
    "category": "Home Appliances",
    "condition": "Brand New",
    "image": "/filter.png",
    "images": ["/filter1.png","/filter2.png", "/filter.png", "/filter3.jpg"],
    "brand": "Xiaomi",
    "inStock": true,
    "features": ["2 × Pre‑HEPA Filters and 1 × HEPA Filter included.", "H12‑grade filtering performance for cleaner exhaust air.", "Washable and reusable filters — easy to clean for repeated use.", "Budget‑friendly replacement pack.", "Compatible with Xiaomi Mi Vacuum Cleaner G9 and G10 models.", "Made from high‑density filter material for durability and efficiency.", "Simple to install — plug & play replacement without hassle.", "Helps maintain strong suction and prolong vacuum cleaner’s lifespan by trapping larger particles before they reach the main HEPA filter."]
  },
  {
    "id": "c10",
    "name": "Xiaomi Vacuum Cleaner G10 Plus Battery Pack",
    "description": "Extend your cleaning sessions with the Xiaomi Vacuum Cleaner G10 Plus Extended Battery Pack. This pack includes an expansion dock that lets you charge and store an extra battery while you clean. Simply place the expansion dock on the charging dock, and both the vacuum and replacement battery can charge simultaneously using a single cable. Designed for Xiaomi G10 Plus vacuums, it provides up to 65 minutes of additional runtime in Eco mode, ensuring uninterrupted cleaning.",
    "category": "Home Appliances",
    "condition": "Brand New",
    "image": "/cleaner1.jpg",
    "images": ["/cleaner.jpg", "/cleaner1.jpg"],
    "brand": "Xiaomi",
    "inStock": true,
    "features": ["Extension dock included — comes with an extra dock to charge and store the replacement battery.", "Simultaneous charging — once the expansion dock is placed on the main charging dock, both the vacuum and the spare battery can charge at the same time with a single cable.", "Extended runtime — provides up to 65 minutes of extra working time in Eco mode (on top of the regular battery).", "Rechargeable Li‑ion battery — the extra battery uses a lithium‑ion cell with 3000 mAh capacity.", "Plug‑and‑play spare battery — designed specifically to be compatible with the Xiaomi G10 Plus vacuum model.", "Lightweight & compact pack — battery pack weight ~ 600 g and compact dimensions — easy to store and handle."]
  },
  {
    "id": "c11",
    "name": "Mi 16-in-1 Ratchet Screwdriver",
    "description": "Extend your cleaning sessions with the Xiaomi Vacuum Cleaner G10 Plus Extended Battery Pack. This pack includes an expansion dock that lets you charge and store an extra battery while you clean. Simply place the expansion dock on the charging dock, and both the vacuum and replacement battery can charge simultaneously using a single cable. Designed for Xiaomi G10 Plus vacuums, it provides up to 65 minutes of additional runtime in Eco mode, ensuring uninterrupted cleaning.",
    "category": "Accessories",
    "condition": "Brand New",
    "image": "/BHR4779GL_wr_01.jpg",
    "images": ["/BHR4779GL_wr_02.jpg", "/BHR4779GL_wr_01.jpg", "/BHR4779GL_wr_03.jpg", "/BHR4779GL_wr_04.jpg"],
    "brand": "Xiaomi",
    "inStock": true,
    "features": ["45‑tooth high‑precision ratchet — provides smooth and efficient ratcheting action.", "Three ratchet settings (R / locked / L) — tighten screws, loosen screws, or use direct drive without ratchet.", "Up to 20 N·m torque — enough force for many household and electronics‑repair tasks.", "16‑in‑1 bit set (8 double‑ended bits) — supports a wide variety of screw types (slotted, Phillips, Pozidriv, hex, Torx, etc.).", "Bits made from S2 alloy steel — offering good hardness (about 60 HRC) and durability for long‑term use.", "Detachable extension rod (≈110 mm) — helps reach screws in deep or narrow spaces.", "Magnetic pop‑up bit magazine built into the handle — stores all bits neatly inside the handle and keeps them secure.", "Ergonomic handle with non-slip grip — handle uses nylon + fiberglass and a TPE rubber coating for comfort and better control.", "Compact and portable — makes it suitable for home use, electronics repair, and general maintenance."]
  }
]


